org/reference/http.org
:PROPERTIES:
:ID:       5fee4aea-f86a-4bd5-9c9a-c2bce69f74e1
:END:
#+title: HTTP

- tags :: [[id:d5337a2c-871b-4761-b625-0f304fb46def][Web Development]]

* GET Requests and Request Body
#+begin_quote
Yes. In other words, any HTTP request message is allowed to contain a
message body, and thus must parse messages with that in mind. Server
semantics for GET, however, are restricted such that a body, if any,
has no semantic meaning to the request. The requirements on parsing
are separate from the requirements on method semantics.

So, yes, you can send a body with GET, and no, it is never useful to
do so.

This is part of the layered design of HTTP/1.1 that will become clear
again once the spec is partitioned (work in progress).

-- Roy Fielding
#+end_quote

Having servers return content based on the value of the request body
in the GET request is a bad practice.
