docs/http.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-01-02 Tue 14:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>HTTP</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jethro Kuan">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/normalize/7.0.0/normalize.css" />
<link rel="stylesheet" href="./css/orgmin.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">HTTP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b6c03e">1. GET Requests and Request Body</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8b6c03e" class="outline-2">
<h2 id="org8b6c03e"><span class="section-number-2">1</span> GET Requests and Request Body</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Yes. In other words, any HTTP request message is allowed to contain a
message body, and thus must parse messages with that in mind. Server
semantics for GET, however, are restricted such that a body, if any,
has no semantic meaning to the request. The requirements on parsing
are separate from the requirements on method semantics.
</p>

<p>
So, yes, you can send a body with GET, and no, it is never useful to
do so.
</p>

<p>
This is part of the layered design of HTTP/1.1 that will become clear
again once the spec is partitioned (work in progress).
</p>

<p>
&#x2013; Roy Fielding
</p>
</blockquote>

<p>
Having servers return content based on the value of the request body
in the GET request is a bad practice.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-01-02 Tue 14:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
